{
  "post-teasers": [
    {
      "teaser-url": "#",
      "teaser-headline": "Balancing Ideal Sass and Ideal CSS",
      "teaser-excerpt": "Sass makes CSS fun again, right? Well yeah, but that also makes it easy to forget that we’re still writing CSS. We can get caught up in all the new tools and tricks that Sass lets us do so easily that we lose sight of some CSS that might not be as awesome as we think it is."
    },
    {
      "teaser-url": "#",
      "teaser-headline": "Fixing H&FJ Font Previews",
      "teaser-excerpt": "I'm considering Hoefler & Frere-Jones webfonts for a new project. The service looks great but I haven't signed up yet. This may be different once I've paid for something, but for now their web preview kind of sucks. (sorry H&FJ) I want to test my own text before making such a big commitment but they only show their own promo text.",
      "teaser-img": {
        "src": "https://unsplash.it/800/800/?image=500",
        "alt": "Square Thumbnail"
      }
    },
    {
      "teaser-url": "#",
      "teaser-headline": "Responsive Web Design and Drupal",
      "teaser-excerpt": "We love Responsive Web Design, and we love Drupal. But do they love each other? After working on a number of RWD and Drupal projects this year, I’m happy to report that they get along just fine. Though “Love” might be stretching it a bit."
    },
    {
      "teaser-url": "#",
      "teaser-headline": "Breakpoint 1.0",
      "teaser-excerpt": "About a month ago I was working on a responsive site, and trying to do it right. So instead of setting break points to match device dimensions (for phone, tablet, and desktop) I would set break points when my content and design needed them. Taking this kind of control over your responsive design means two things:",
      "teaser-img": {
        "src": "https://unsplash.it/800/800/?image=501",
        "alt": "Square Thumbnail"
      }
    },
    {
      "teaser-url": "#",
      "teaser-headline": "Starting in a Nice, Clean Place",
      "teaser-excerpt": "It’s time for a spring cleaning and refresh over here. It’s been about a year since I launched this site, and even tho I’m still pretty happy with it overall I think it’s time for a change. It started as just a one-pager that I used to introduce and then demonstrate my Survival Kit project. And then I added a podcast. And then I added a blog, but nobody saw that because I did more blog posts on other sites. And all the while I was adding to the design.",
      "teaser-img": {
        "src": "https://unsplash.it/800/800/?image=502",
        "alt": "Square Thumbnail"
      }
    }
  ]
}


