{
  "post-title": "Responsive Web Design and Drupal",
  "post-content": "<article class=\"page\">\n  <p>We love <a href=\"http://alistapart.com/article/responsive-web-design\">Responsive Web Design</a>, and we love Drupal. But do they love each other? After working on a number of <span class=\"caps\">RWD</span> and Drupal projects this year, I’m happy to report that they get along just fine. Though “Love” might be stretching it a&nbsp;bit.</p>\n\n  <h2>Can Drupal and <span class=\"caps\">RWD</span> be&nbsp;Pals?</h2>\n\n  <p>Drupal is a great platform for managing content and for building everything from simple blogs to very complex applications. By connecting Drupal’s building blocks, you can build just about any functionality you need. That’s amazing, especially if you’ve ever struggled to build any aspect of that on your own. My Drupal a-ha moment came when I realized that I’d never need to write a user log-in on my own again. Smarter people than me were on the&nbsp;case.</p>\n\n  <p>But that speaks to two key aspects of Drupal that aren’t directly related to <span class=\"caps\">RWD</span>. Drupal is primarily a back-end tool that excels when the building blocks are abstracted to be applicable to as many use cases as possible. Defining views and content types rightly doesn’t prescribe any layout or visual design, leaving those tasks to your creativity in the theming&nbsp;layer.</p>\n\n  <p>The best Drupal themes are also the ones that are the most general, allowing you to add all the custom details yourself. Good design is in the details, and the details are always custom. A good starter theme gives you the tools you need to have total control over those details and then gets out of your way. Themes that provide a full visual design must have their place, but I’ve never had a client that wanted to look like everyone else who installed the same theme. When a starter theme gets out of your way, you get something pretty fantastic: a back end system that provides the data and markup you need and a blank canvas where you can write whatever <span class=\"caps\">CSS</span> and JavaScript you want to make something unique and&nbsp;delightful.</p>\n\n  <p>Responsive Web Design, just like any other flavor of design, is all about custom solutions. The difference is that we have the opportunity to change and refine the design around different browser characteristics, like the browser width. It’s natural that a designer would want a system to help with all this added complexity, but in most aspects, Drupal doesn’t provide such a system. But then again, it doesn’t provide a system for logo design either. It’s just not the right tool for that particular&nbsp;task.</p>\n\n  <p>Personally, I prefer Drupal as a blank canvas. With tools like <a href=\"http://sass-lang.com/\">Sass</a> and the <a href=\"http://breakpoint-sass.com/\">whole</a> <a href=\"http://susy.oddbird.net/\">wide</a> <a href=\"http://css-tricks.com/\">world</a> of css techniques, I think we have some pretty great options&nbsp;already.</p>\n  <footer class=\"footer-date\">\n    Posted on Tuesday, February 12th, 2013    </footer>\n</article>\n"
}
